Repository: DawidStasko/FinancialTransactionTextInterpreter
Catalog: FinancialTransactionTextInterpreter/Localization/Strings.*.resx
Languages: pl_pl

# ErrorMessage_InformationAboutAccountsNumberInTransaction
source: Transaction text should contain at least one and no more than two accounts.
pl_pl: Tekst transakcji powinien zawierać co najmniej jedno i nie więcej niż dwa konta.

# ErrorMessage_InformationAboutCategoryRequirementForItems
source: Items need to have category written before them.
pl_pl: Elementy transakcji powinny mieć wpisaną kategorię przed nimi.

# ErrorMessage_InformationAboutContractorsNumber
source: Transaction text contains too many contractors.
pl_pl: Tekst transakcji zawiera zbyt wielu kontraktorów.

# ErrorMessage_InformationAboutDateFormat
source: Date format should be dd-MM-yyyy.
pl_pl: Data powinna mieć format dd-MM-yyyy.

# ErrorMessage_ProcessingWasNotDoneYet
source: Processing was not done yet.
pl_pl: Tekst transakcji nie został jeszcze zinterpretowany.

# ErrorMessage_TransactionTextIsEmpty
source: Transaction text is empty.
pl_pl: Tekst transakcji jest pusty.

# ErrorMessage_UnexpectedErrorWhenProcessing
source: Unexpected error occurred when processing transaction.
pl_pl: Niespodziewany błąd podczas procesowania transakcji.

# HelpBoxView_ExamplesSectionContent
source: - Transaction with item names: &22-04-2024 $Wallet #Food roll 2.2 2.2 +0.4 ham 3.3 #Craving bar 4.5 @Frog. From this text, a transaction will be created with a contractor named Frog, concluded on April 22, 2024, which was paid from an account named wallet. The elements of this transaction will be created: a roll with a price - 4 and a food category, a ham with a price - 3.3 and a food category, and a bar with a price - 4.5 and a craving category. - Transaction without item names &22-04-2024 $Bank #Food 2.2 2.2 +0.4 3.3 #Craving 4.5 @Frog. In this case, a transaction will also be created with a counterparty named Frog, concluded on April 22, 2024, which was paid from an account named bank. However, it will have two items one named food with a price of -7.3 and a food category and the other named craving with a price of -4.5 and the name craving. - Transfer: &22-04-2024 $Bank > $Wallet 2.2 2.2 +0.4 3.3 Two transactions will be created the first one which is paid from the Bank account and the counterparty is Wallet which has one element named transfer with the category TransferOut and the value -7.3 and the second one ""paid"" from the Wallet account and the counterparty Bank and the element transfer with the category TransferIn and the value 7.3. Element names, categories or counterparty are not allowed in transfers.
pl_pl: - Transakcja z nazwami elementów: &22-04-2024 $Portfel #Jedzenie bułka 2.2 2.2 +0.4 szynka 3.3 #Zachcianka baton 4,5 @Żaba Z tego tekstu utworzona zostanie transakcja z kontrahentem o nazwie Żaba, zawarta 22 kwietnia 2024 roku, którą opłacono z konta o nazwie portfel. Utworzone w zostaną elementy tej transakcji: bułka z ceną - 4 i kategorią jedzenie, szynka z ceną - 3.3 i kategorią jedzenie oraz baton z ceną - 4.5 i kategorią zachcianka. - Transakcja bez nazw elementów &22-04-2024 $Bank #Jedzenie 2.2 2.2 +0.4 3.3 #Zachcianka 4,5 @Żaba W tym przypadku utworzona zostanie również transakcja z kontrahentem o nazwie Żaba, zawarta 22 kwietnia 2024 roku, którą opłacono z konta o nazwie bank. Jednakże będzie ona miała dwa elementy jeden o nazwie jedzenie z ceną - 7.3 i kategorią jedzenie i drugi o nazwie zachcianka z ceną -4.5 i nazwą Zachcianka - Transfer: &22-04-2024 $Bank > $Portfel 2.2 2.2 +0.4 3.3 Utworzone zostaną dwie transakcję pierwsza którą opłaconą z konta Bank i kontrahentem jest Portfel która posiada jeden element o nazwie transfer z kategorią TransferOut i wartością -7.3 oraz drugą ""opłaconą"" z konta Portfel i kontrahentem Bank oraz elementem transfer z kategorii TransferIn i wartością 7.3. W transferach nie są dozwolone nazwy elementów, kategorie czy też kontrahent.

# HelpBoxView_ExamplesSectionTitle
source: Examples
pl_pl: Przykłady

# HelpBoxView_GeneralHelpSectionContent
source: Definitions: - Transaction - transaction/action done with external contractor: shop, employer, account outside your system. - Transfer - transaction/action done between internal accounts like from cash to bank. - Tag - character in the beginning of word used to determine kind of data to assign it. Features: - Each element of the transaction is assigned the nearest preceding category. - All words without a tag and that are not numbers are treated as the name of the transaction element. If there is no name, the current category will be assigned. - All words that are numbers after the given name are summed and recorded as the item price
pl_pl: Słowniczek: - Transakcja - transakcja wykonywana z podmiotem zewnętrznym: sklep, pracodawcą czy kimś z rodziny - Transfer - transakcja wykonywana pomiędzy wewnętrznymi kontami, np. wypłata z konta i włożenie pieniędzy do portfela - Tag - znak na początku pojedynczego wyrazu w tekście transakcji określający rodzaj danych do których wyraz się odnosi. Funkcjonalności: - Każdemu elementowi transakcji przypisywana jest najbliższa poprzedzająca go kategoria. - Wszystkie wyrazy bez tagu i nie będące liczbami są traktowane jako nazwa elementu transakcji. W przypadku braku nazwy przypisana zostanie aktualna kategoria. - Wszystkie wyrazy będące liczbami po danej nazwie są sumowane i zapisywane jako cena elementu

# HelpBoxView_GeneralHelpSectionTitle
source: Help
pl_pl: Pomoc

# HelpBoxView_TagsSectionContent
source: - & - date. One date per transaction/transfer. - $ - account. Only one account can be indicated in a transaction. In a transfer two: source and destination. The flow of money is determined by the character '> - # - category. It can be entered only for a transaction. Any item entered after the category will belong to it'. - @ - counterparty. One counterparty per transaction and only in a transaction can be entered. - + - used in transactions/transfers to specify revenue. By default all numbers are treated as negative unless a plus is used before them - no sign means that the word belongs to the transaction item name or is the item price.
pl_pl: - & - data. Jedna data na transakcje/transfer. - $ - konto. W transakcji można wskazać tylko jedno konto. W transferze dwa: źródłowe i docelowe. Przepływ pieniędzy określa znak '> - # - kategoria. Może byś wprowadzona tylko dla transakcji. Każdy element wpisany po danej kategorii będzie do niej należał' - @ - kontrahent. Jeden kontrahent na transakcję i tylko w transakcji może być wprowadzony. - + - używany w transakcjach/transferach do określenia przychodu. By default wszystkie liczby są traktowane jako ujemne, chyba że użyto przed nimi plusa - brak znaku oznacza że wyraz należy do nazwy elementu transakcji albo jest ceną elementu.

# HelpBoxView_TagsSectionTitle
source: Tags
pl_pl: Tagi

# LanguageSelector_MessageBoxContent
source: Please restart the application to apply the new language.
pl_pl: Aplikacja wymaga ponownego uruchomienia w celu wprowadzenia zmian w ustawieniach.

# LanguageSelector_MessageBoxTitle
source: Restart Required
pl_pl: Wymagane ponowne uruchomienie

# PromptInput_ClearTextButton
source: Clear text
pl_pl: Wyczyść tekst

# PromptInput_ProcessTextButton
source: Add
pl_pl: Dodaj
